# Projection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ContinuousRailType..::..Projection Property
ContinuousRailType Class See Also
---
The horizontal distance between the outer boundary of the rail and the path.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double Projection { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Projection As Double
	Get
```

Visual C++
---
```text
public:
property double Projection {
	double get ();
}
```

# See Also
ContinuousRailType Class
Autodesk.Revit.DB.Architecture Namespace